tap "boz/repo"
tap "chase/tap"
tap "esolitos/ipa"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jfryy/tap"
tap "koekeishiya/formulae"
tap "lacework/tap"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "ynqa/tap"
brew "ack"
brew "cffi", link: false
brew "openssl@3"
brew "ansible"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argc"
brew "automake"
brew "python@3.12"
brew "awscli"
brew "bash"
brew "bat"
brew "gettext"
brew "libx11"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "black"
brew "carapace"
brew "cargo-bundle"
brew "circumflex"
brew "cmake"
brew "curl"
brew "libtool"
brew "libavif"
brew "gd"
brew "php"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "dateutils"
brew "difftastic"
brew "dnsperf"
brew "docker"
brew "docutils"
brew "dos2unix"
brew "elvish"
brew "node"
brew "eslint"
brew "libgit2"
brew "exa"
brew "exif"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "gnutls"
brew "openjpeg"
brew "figlet"
brew "findutils"
brew "fish"
brew "fping"
brew "fswatch"
brew "fzf"
brew "fzy"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "subversion"
brew "git-svn"
brew "gnupg"
brew "gpgme"
brew "gnu-tar"
brew "go"
brew "go-task"
brew "goreleaser"
brew "librsvg"
brew "graphviz"
brew "grc"
brew "grep"
brew "gzip"
brew "helm"
brew "highlight"
brew "htop"
brew "httpie"
brew "iftop"
brew "libheif"
brew "imagemagick"
brew "jc"
brew "jq"
brew "julia"
brew "kubernetes-cli"
brew "libffi"
brew "lolcat"
brew "lsd"
brew "luarocks"
brew "makeself"
brew "maven"
brew "protobuf"
brew "mosh"
brew "mpv"
brew "mtr"
brew "multitail"
brew "mutt"
brew "mysql"
brew "mysql-client@8.4"
brew "n"
brew "neofetch"
brew "neomutt"
brew "neovim"
brew "ngs"
brew "ninja"
brew "nmap"
brew "nushell"
brew "oil"
brew "openssh"
brew "openssl@1.1"
brew "opentofu"
brew "pgcli", link: false
brew "pkgconf"
brew "pnpm"
brew "poetry"
brew "postgresql@14"
brew "pyright", link: false
brew "python-tk@3.10"
brew "python@3.11"
brew "python-tk@3.11"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sd"
brew "serverless"
brew "sha3sum"
brew "shellcheck"
brew "simde"
brew "six"
brew "stern"
brew "stylua"
brew "telnet"
brew "terraformer"
brew "tmux"
brew "tmuxp"
brew "trippy"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "xclip"
brew "xcodegen"
brew "yarn"
brew "yq", link: false
brew "zellij"
brew "zig"
brew "zsh"
brew "zsh-vi-mode"
brew "boz/repo/kail"
brew "chase/tap/awrit"
brew "esolitos/ipa/sshpass"
brew "hashicorp/tap/terraform"
brew "jfryy/tap/qq"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lacework/tap/lacework-cli"
brew "noahgorstein/tap/jqp"
brew "ynqa/tap/sigrs"
cask "aerospace"
cask "calibre"
cask "discord"
cask "font-maple-mono"
cask "font-victor-mono"
cask "fontforge"
cask "gimp"
cask "kitty"
cask "ngrok"
cask "qutebrowser"
cask "rar"
cask "sqlcl"
cask "the-unarchiver"
cask "vagrant"
cask "vlc"
cask "webpquicklook"
